First of all, let's import necessary libraries/packages we are going to work with.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
sns.set()

 Now, let's load the data.

In [3]:
df_complete = pd.read_csv('Index2018.csv')

Next step is to convert dataframe in Time Series. First, let's check type of date column.

In [4]:
type(df_complete.date[0])

str

As we can see, the type is string. So, we need to convert this column to datetime format.

In [5]:
df_complete.date = pd.to_datetime(df_complete.date, dayfirst=True)

In [6]:
print(type(df_complete.date[0]))
df_complete.date.describe()

<class 'pandas._libs.tslibs.timestamps.Timestamp'>

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

Done! Now, in order to work with time series, it's necessary to have the datetime column as the index ot the dataframe. Let's to this.

In [7]:
df_complete.set_index('date', inplace=True)

In [9]:
print(df_complete.head(2))

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44

Notice that we don't have column with sequential numerical corresponding to the index. Now the data column is the new index.

OK. Next step. Setting the desired frequency. Regarding our dataset, data were collected daily.

In [10]:
df_complete = df_complete.asfreq('d')

In [11]:
df_complete.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

Notice that previously in the dataset we didn't those two days ("1994-01-08" and "1994-01-09"). However, as time series need constant periods, pandas created them for us.

Also notice that our dataset is related with closing prices of financial indices. This way, instead of treating those date, which are weekend days, let's create a frequency considering only working days.

In [12]:
df_complete = df_complete.asfreq('b')

In [13]:
df_complete.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

Great!!!! Good job so far.

Handling with missing values

Now, let's take a look into missing values, that might be created while setting up the frequency. Let's check de dataset.

In [15]:
df_complete.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

As we can see, there are 8 missing values for each column in the dataset. It happened due to new days created when setting up frequency, that didn't exist in the original dataset. Let's see these rows.

In [22]:
df_complete[(df_complete['spx'].isna()==1) | (df_complete['dax'].isna()==1) 
           | (df_complete['ftse'].isna()==1)| (df_complete['nikkei'].isna()==1)]

            spx  dax  ftse  nikkei
date
2008-01-01  NaN  NaN   NaN     NaN
2009-01-01  NaN  NaN   NaN     NaN
2010-01-01  NaN  NaN   NaN     NaN
2013-01-01  NaN  NaN   NaN     NaN
2014-01-01  NaN  NaN   NaN     NaN
2015-01-01  NaN  NaN   NaN     NaN
2016-01-01  NaN  NaN   NaN     NaN
2018-01-01  NaN  NaN   NaN     NaN

Dealing with missing values require some specific approach in order to keep the dataset coherent. For this time series, I choosen to fill up the missin data with the last previous existing data for the column.

In [23]:
df_complete.spx = df_complete.spx.fillna(method="ffill")

In [25]:
print(df_complete.isna().sum())
print(df_complete[(df_complete['spx'].isna()==1) | (df_complete['dax'].isna()==1) 
           | (df_complete['ftse'].isna()==1)| (df_complete['nikkei'].isna()==1)])

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64
                    spx  dax  ftse  nikkei
date
2008-01-01  1468.355174  NaN   NaN     NaN
2009-01-01   903.254921  NaN   NaN     NaN
2010-01-01  1115.102681  NaN   NaN     NaN
2013-01-01  1426.187978  NaN   NaN     NaN
2014-01-01  1848.356521  NaN   NaN     NaN
2015-01-01  2058.902379  NaN   NaN     NaN
2016-01-01  2043.936863  NaN   NaN     NaN
2018-01-01  2673.610523  NaN   NaN     NaN

Notice that now there aren't missing data for spx column. Let's do the same for the other columns.

In [26]:
df_complete.dax = df_complete.dax.fillna(method="ffill")
df_complete.ftse = df_complete.ftse.fillna(method="ffill")
df_complete.nikkei = df_complete.nikkei.fillna(method="ffill")

In [27]:
print(df_complete.isna().sum())
print(df_complete[(df_complete['spx'].isna()==1) | (df_complete['dax'].isna()==1) 
           | (df_complete['ftse'].isna()==1)| (df_complete['nikkei'].isna()==1)])

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64
Empty DataFrame
Columns: [spx, dax, ftse, nikkei]
Index: []

OK. No missing data. Let's move on.

Adding and removing columns in a Data Frame.

For the sake of simplicity, let's continue analysing only S&P data. Preprocessing is an important step. Thus, let's create a new column, with a title "market_value" which contains the same value of spx. After this, let's delete the four original columns.

In [28]:
df_complete['market_value'] = df_complete.spx

In [30]:
df_complete.drop(['spx','dax','ftse','nikkei'], axis=1, inplace=True)

In [31]:
df_complete.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

OK. Let's move on.

Now, we are going to split the data in training set and testing set. However we can't perform this task choosing randomly data. This is due to time series need a chronological order of the data. So, let's consider 80% of first data as training set and the remaining as testing set.

In [32]:
size = int(len(df_complete)*0.8)

In [33]:
# training set
df = df_complete.iloc[:size]

In [34]:
# testing set
df_test = df_complete.iloc[size:]

Now, it's important to check whether there aren't overlaps. To do so, we are going to take the last 5 rows from training set and the 5 first rows from testing set.

In [35]:
df.tail(5)

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [36]:
df_test.head(5)

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623

Nice. No overlap!

Now let's save the dataframes individually in order to use them in the next notebook.

In [37]:
df_complete.to_csv('df_complete.csv')

In [38]:
df.to_csv('df_train.csv')

In [39]:
df_test.to_csv('df_test.csv')

So far we have done a lot of things. Uau, this is amazing!
In the next notebook we are going to work with the time series that we have just created. See you there.